modules/account/vm/atlas/chart.dot
digraph {
  edge [arrowhead="normal",color="white"]
  graph [layout="dot",bgcolor="#1c1c1c",rankdir="TB",ranksep="1.5"]
  node [shape="box",style="filled",fontcolor="white",color="transparent"]
  ":account:domain" [fillcolor="#160185"]
  ":account:vm" [fillcolor="#914141"]
  ":api:actual" [fillcolor="#160185"]
  ":budget:data" [fillcolor="#160185"]
  ":budget:model" [fillcolor="#160185"]
  ":codegen:annotation" [fillcolor="#160185"]
  ":core:di" [fillcolor="#a17103"]
  ":core:model" [fillcolor="#160185"]
  ":logging" [fillcolor="#160185"]
  ":prefs" [fillcolor="#160185"]
  ":account:domain" -> ":api:actual" [style="dashed"]
  ":account:domain" -> ":core:model" [style="bold"]
  ":account:domain" -> ":logging" [style="dashed"]
  ":account:domain" -> ":prefs" [style="dashed"]
  ":account:vm" -> ":account:domain" [style="bold"]
  ":account:vm" -> ":api:actual" [style="dashed"]
  ":account:vm" -> ":core:di" [style="bold"]
  ":account:vm" -> ":core:model" [style="bold"]
  ":account:vm" -> ":logging" [style="dashed"]
  ":account:vm" -> ":prefs" [style="bold"]
  ":api:actual" -> ":budget:model" [style="bold"]
  ":api:actual" -> ":codegen:annotation" [style="dashed"]
  ":api:actual" -> ":core:model" [style="bold"]
  ":budget:data" -> ":budget:model" [style="bold"]
  ":budget:data" -> ":core:model" [style="bold"]
  ":budget:data" -> ":logging" [style="dashed"]
  ":core:di" -> ":budget:data" [style="bold"]
  ":core:di" -> ":budget:model" [style="bold"]
  ":prefs" -> ":core:model" [style="bold"]
}
